title: Systemd Service File Created or Modified
id: f2g8h6i5-7e0d-8f6g-dh9h-5j0e1f2g3h4i
status: test
description: >
  Detects creation or modification of systemd service files in /etc/systemd/system/
  or /usr/lib/systemd/system/. Attackers create malicious systemd services to
  establish persistence that survives reboots and runs automatically.
references:
  - https://attack.mitre.org/techniques/T1543/003/
  - https://github.com/enak223/project-tripwire
author: Eliezer Fuentes
date: 2026/06/20
tags:
  - attack.persistence
  - attack.t1543.003
logsource:
  product: linux
  service: auditd
detection:
  selection:
    type: SYSCALL
    key: tripwire_systemd_service
  filter:
    comm:
      - systemd
      - snapd
      - apt
      - dpkg
  condition: selection and not filter
falsepositives:
  - System administrators creating legitimate services
  - Package managers installing service files during software installation
  - Configuration management tools (Ansible, Puppet) deploying services
level: high
